
<!DOCTYPE html>
<html lang="pt-br">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="./cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
    <script src="./code.jquery.com/jquery-3.7.1.min.js" integrity="sha256-/JqT3SQfawRcv/BIHPThkBvs0OEvtFFmqPF/lYI/Cxo=" crossorigin="anonymous"></script>
    <link rel="icon" href="favico.jpg" type="image/x-icon">
    <link rel="apple-touch-icon" sizes="180x180" href="favico.jpg">
    <script src="date.js"></script>
    <title>Site Oficial | Thiago Oliveira</title>


</head>
<body>

    <article style="display:none;"> 
        <h1>O Que &eacute; um Site Oficial e Por Que Ele &eacute; Importante?</h1>

        <p>Na era digital em que vivemos, um site oficial &eacute; uma ferramenta crucial para empresas, organiza&ccedil;&otilde;es, figuras p&uacute;blicas e at&eacute; mesmo para indiv&iacute;duos que desejam ter uma presen&ccedil;a online consolidada. Mas afinal, o que &eacute; um site oficial e por que ele &eacute; t&atilde;o importante nos dias de hoje?</p>
        
        <p>Um site oficial &eacute; uma p&aacute;gina da web que representa uma entidade, seja ela uma empresa, uma institui&ccedil;&atilde;o, um governo, uma celebridade ou qualquer outro tipo de organiza&ccedil;&atilde;o. Ele serve como uma plataforma central para apresentar informa&ccedil;&otilde;es relevantes, produtos, servi&ccedil;os, e at&eacute; mesmo interagir com o p&uacute;blico-alvo.</p>
        
        <p><strong>Caracter&iacute;sticas de um Site Oficial:</strong></p>
        
        <ol>
            <li>
            <p><strong>Identidade Visual Consistente:</strong> Um site oficial geralmente segue uma identidade visual consistente com a marca ou a personalidade que ele representa. Isso inclui o uso de logotipos, cores, fontes e estilos de design que s&atilde;o reconhec&iacute;veis e distintos.</p>
            </li>
            <li>
            <p><strong>Informa&ccedil;&otilde;es Relevantes e Atualizadas:</strong> Um site oficial deve fornecer informa&ccedil;&otilde;es atualizadas e precisas sobre a entidade que representa. Isso pode incluir detalhes sobre produtos e servi&ccedil;os, informa&ccedil;&otilde;es de contato, atualiza&ccedil;&otilde;es de eventos, not&iacute;cias e outros conte&uacute;dos relevantes.</p>
            </li>
            <li>
            <p><strong>Navega&ccedil;&atilde;o Intuitiva:</strong> A navega&ccedil;&atilde;o em um site oficial deve ser intuitiva e f&aacute;cil de usar. Os visitantes devem poder encontrar facilmente o que est&atilde;o procurando, seja por meio de um menu de navega&ccedil;&atilde;o claro, uma barra de pesquisa eficaz ou links bem organizados.</p>
            </li>
            <li>
            <p><strong>Seguran&ccedil;a e Confian&ccedil;a:</strong> Um site oficial geralmente &eacute; projetado com medidas de seguran&ccedil;a para proteger os dados dos usu&aacute;rios e garantir uma experi&ecirc;ncia de navega&ccedil;&atilde;o segura. Isso inclui a utiliza&ccedil;&atilde;o de certificados SSL para criptografar informa&ccedil;&otilde;es sens&iacute;veis e pol&iacute;ticas de privacidade claras.</p>
            </li>
            <li>
            <p><strong>Compatibilidade com Dispositivos M&oacute;veis:</strong> Com o aumento do uso de dispositivos m&oacute;veis, &eacute; essencial que um site oficial seja responsivo e compat&iacute;vel com uma variedade de dispositivos e tamanhos de tela. Isso garante que os visitantes tenham uma experi&ecirc;ncia positiva, independentemente do dispositivo que est&atilde;o usando.</p>
            </li>
        </ol>
        
        <p><strong>Import&acirc;ncia de um Site Oficial:</strong></p>
        
        <ol>
            <li>
            <p><strong>Presen&ccedil;a Online:</strong> Em um mundo cada vez mais conectado, ter um site oficial &eacute; essencial para estabelecer e manter uma presen&ccedil;a online. Isso permite que uma entidade seja facilmente encontrada e acessada pelos usu&aacute;rios em todo o mundo.</p>
            </li>
            <li>
            <p><strong>Credibilidade e Profissionalismo:</strong> Um site oficial bem projetado transmite credibilidade e profissionalismo. Ele mostra que a entidade est&aacute; comprometida com sua presen&ccedil;a online e investe em fornecer uma experi&ecirc;ncia de alta qualidade para seus visitantes.</p>
            </li>
            <li>
            <p><strong>Comunica&ccedil;&atilde;o e Engajamento:</strong> Um site oficial serve como um canal de comunica&ccedil;&atilde;o direta com o p&uacute;blico-alvo. Ele permite que uma entidade compartilhe informa&ccedil;&otilde;es, promova produtos ou servi&ccedil;os e interaja com os visitantes por meio de formul&aacute;rios de contato, coment&aacute;rios e redes sociais integradas.</p>
            </li>
            <li>
            <p><strong>Marketing e Branding:</strong> Um site oficial &eacute; uma ferramenta poderosa para o marketing e o branding. Ele oferece uma plataforma para promover a marca, contar sua hist&oacute;ria e diferenciar-se da concorr&ecirc;ncia.</p>
            </li>
            <li>
            <p><strong>Acesso Global:</strong> Um site oficial est&aacute; acess&iacute;vel a qualquer pessoa com acesso &agrave; internet, permitindo que uma entidade alcance um p&uacute;blico global 24 horas por dia, 7 dias por semana.</p>
            </li>
        </ol>
        
        <p>Em resumo, um site oficial &eacute; uma parte essencial da estrat&eacute;gia de presen&ccedil;a online de qualquer entidade nos dias de hoje. Ele serve como uma vitrine digital, proporcionando uma maneira eficaz de comunicar informa&ccedil;&otilde;es, promover produtos ou servi&ccedil;os e interagir com o p&uacute;blico-alvo. Investir em um site oficial bem projetado e mantido &eacute; fundamental para o sucesso no mundo digital em constante evolu&ccedil;&atilde;o.</p>
        
    
    
    
    </article>
    <header>
        <i class="fa-solid fa-bars"></i>
        <img src="opinilogo.png" alt="">
        <span id="saldo" style="margin-left: auto;">R$25,00</span>
    </header>
    <main>
        <div class="main__saldo">
            <p>SEU SALDO</p>
            <p>R$25,00</p>
        </div>
        <div class="main__descricao">
            <p>Seu crédito de R$25,00 expira hoje, <span id="todayDate"></span>.</p>
            <p>Faça 3 avaliações e realize seu primeiro saque!</p>
            <p>MINHAS TAREFAS</p>
        </div>
        <div class="card apresentacao">
            <h2>PARA SACAR É SÓ COMEÇAR A AVALIAR</h2>
            <p>Você acaba de ganhar 1 licença gratuita para avaliar as empresas cadastradas e parceiras do Google! <strong>Aproveite, você já ganhou R$25,00!</strong></p>
            <a href="etapa2.html"><button>COMEÇAR</button></a>
        </div>
    </main>
    <footer>
    </footer>
        <script type="text/javascript" src="./cdnjs.cloudflare.com/ajax/libs/crypto-js/4.0.0/crypto-js.min.js"></script>
<script>
    var url_domain = window.location.hostname;
        console.log(url_domain);
            // console.log(result);
            var utm_term = undefined;
        
            var url_string = window.location.href
            var url = new URL(url_string.html);
            var utm_campaign_value = url.searchParams.get("utm_campaign");
            var url_domain = window.location.hostname;

            if(utm_term == undefined){
                var utm_campaign = "xcon="+utm_campaign_value;
            }
            function setUrlParams2(el) {
            var term = utm_campaign;
               if (el.href.indexOf('#') == -1) {
                     var src = "";
                    var querystring = location.search
                    var querystring_without_int_mark = querystring.split("?", 2)[1]

                    var existsUrl = el.href;
                    var existsquerystring = existsUrl.split("?", 2)[1]

                    // console.log(querystring_without_int_mark, existsquerystring)

                    if (existsquerystring === undefined && querystring_without_int_mark !== undefined) {
                        el.href = existsUrl.split("?", 2)[0] + '?' + querystring_without_int_mark+"&"+utm_campaign;
                        return;
                    }
                    if (existsquerystring !== undefined && querystring_without_int_mark !== undefined) {
                        el.href = existsUrl.split("?", 2)[0] + '?' + existsquerystring + '&' + querystring_without_int_mark+"&"+utm_campaign;
                        return;
                    }

                    if (querystring_without_int_mark !== undefined) {
                        el.href = existsUrl.split("?", 2)[0] + '?' + existsquerystring + '&' + querystring_without_int_mark+"&"+utm_campaign;
                    }
                    if (querystring_without_int_mark == undefined && existsquerystring == undefined) {
                        el.href = existsUrl;
                    }
                    if (existsquerystring !== undefined) {
                        el.href = existsUrl;
                    }

                    console.log('url: '+existsUrl)
                }
            }
            var links = document.querySelectorAll('a');

            links.forEach(setUrlParams2);


</script><script>
    setTimeout(function() {
        document.querySelector('.elementor-button').style.display = 'block';
    }, 960000);
</script>

</body>

</html>